In [1]:
import pyspark
import findspark
findspark.init()

In [2]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName("Group by").getOrCreate()
spark

In [37]:
data=[("Chandu","Data Science",10000),
     ("Chandu","IOT",5000),
     ("Rohith","Big Data",4000),
     ("Chandu","Big Data",4000),
     ("Rohith","Big Data",3000),
     ("Krishna","Data Science",20000),
     ("Krishna","IOT",10000),
     ("Krishna","Big Data",5000),
     ("Rashmi","Data Science",10000),
     ("Rashmi","Big Data",2000)]

columns=["Name","Departments","Salary"]
df=spark.createDataFrame(data=data,schema=columns)

In [38]:
df.show()

+-------+------------+------+
|   Name| Departments|Salary|
+-------+------------+------+
| Chandu|Data Science| 10000|
| Chandu|         IOT|  5000|
| Rohith|    Big Data|  4000|
| Chandu|    Big Data|  4000|
| Rohith|    Big Data|  3000|
|Krishna|Data Science| 20000|
|Krishna|         IOT| 10000|
|Krishna|    Big Data|  5000|
| Rashmi|Data Science| 10000|
| Rashmi|    Big Data|  2000|
+-------+------------+------+

In [39]:
# using group by
# 1) sum()
df.groupBy("Departments").sum("Salary").show()

+------------+-----------+
| Departments|sum(Salary)|
+------------+-----------+
|Data Science|      40000|
|         IOT|      15000|
|    Big Data|      18000|
+------------+-----------+

In [40]:
# 2) min()
df.groupBy("Departments").min("Salary").show()

+------------+-----------+
| Departments|min(Salary)|
+------------+-----------+
|Data Science|      10000|
|         IOT|       5000|
|    Big Data|       2000|
+------------+-----------+

In [41]:
# 3) max()
df.groupBy("Departments").max("Salary").show()

+------------+-----------+
| Departments|max(Salary)|
+------------+-----------+
|Data Science|      20000|
|         IOT|      10000|
|    Big Data|       5000|
+------------+-----------+

In [42]:
# 4) avg
df.groupBy("Departments").avg("Salary").show()

+------------+------------------+
| Departments|       avg(Salary)|
+------------+------------------+
|Data Science|13333.333333333334|
|         IOT|            7500.0|
|    Big Data|            3600.0|
+------------+------------------+

In [43]:
# 5) mean()
df.groupBy("Departments").mean("Salary").show()

+------------+------------------+
| Departments|       avg(Salary)|
+------------+------------------+
|Data Science|13333.333333333334|
|         IOT|            7500.0|
|    Big Data|            3600.0|
+------------+------------------+

In [44]:
# 6) count()
df.groupBy("Departments").count().show()

+------------+-----+
| Departments|count|
+------------+-----+
|Data Science|    3|
|         IOT|    2|
|    Big Data|    5|
+------------+-----+

In [45]:
# 7) agg
df.groupBy("Departments").agg(sum(df.Salary).alias("Salary_sum"),min(df.Salary).alias("Min_Salary")).show()

+------------+----------+----------+
| Departments|Salary_sum|Min_Salary|
+------------+----------+----------+
|Data Science|     40000|     10000|
|         IOT|     15000|      5000|
|    Big Data|     18000|      2000|
+------------+----------+----------+

In [46]:
# 8) pivot()
#aggregation where one of the grouping column values is transposed into individual columns with distinct data
df.groupBy("Departments").pivot("Name").sum("Salary").show()

+------------+------+-------+------+------+
| Departments|Chandu|Krishna|Rashmi|Rohith|
+------------+------+-------+------+------+
|         IOT|  5000|  10000|  NULL|  NULL|
|    Big Data|  4000|   5000|  2000|  7000|
|Data Science| 10000|  20000| 10000|  NULL|
+------------+------+-------+------+------+

In [47]:
# orderBy and sort()
# Sort based on single column
df.sort("Salary").show()

+-------+------------+------+
|   Name| Departments|Salary|
+-------+------------+------+
| Rashmi|    Big Data|  2000|
| Rohith|    Big Data|  3000|
| Rohith|    Big Data|  4000|
| Chandu|    Big Data|  4000|
|Krishna|    Big Data|  5000|
| Chandu|         IOT|  5000|
| Rashmi|Data Science| 10000|
|Krishna|         IOT| 10000|
| Chandu|Data Science| 10000|
|Krishna|Data Science| 20000|
+-------+------------+------+

In [48]:
# Sorting in descending order
df.sort(df.Salary.desc()).show()

+-------+------------+------+
|   Name| Departments|Salary|
+-------+------------+------+
|Krishna|Data Science| 20000|
| Chandu|Data Science| 10000|
|Krishna|         IOT| 10000|
| Rashmi|Data Science| 10000|
| Chandu|         IOT|  5000|
|Krishna|    Big Data|  5000|
| Chandu|    Big Data|  4000|
| Rohith|    Big Data|  4000|
| Rohith|    Big Data|  3000|
| Rashmi|    Big Data|  2000|
+-------+------------+------+

In [49]:
# sort based on first column and then on second column
df.sort(df.Departments,df.Salary).show()

+-------+------------+------+
|   Name| Departments|Salary|
+-------+------------+------+
| Rashmi|    Big Data|  2000|
| Rohith|    Big Data|  3000|
| Rohith|    Big Data|  4000|
| Chandu|    Big Data|  4000|
|Krishna|    Big Data|  5000|
| Chandu|Data Science| 10000|
| Rashmi|Data Science| 10000|
|Krishna|Data Science| 20000|
| Chandu|         IOT|  5000|
|Krishna|         IOT| 10000|
+-------+------------+------+

In [50]:
# orderBy can also be used in place of sort()
df.orderBy(df.Departments,df.Salary).show()

+-------+------------+------+
|   Name| Departments|Salary|
+-------+------------+------+
| Rashmi|    Big Data|  2000|
| Rohith|    Big Data|  3000|
| Rohith|    Big Data|  4000|
| Chandu|    Big Data|  4000|
|Krishna|    Big Data|  5000|
| Chandu|Data Science| 10000|
| Rashmi|Data Science| 10000|
|Krishna|Data Science| 20000|
| Chandu|         IOT|  5000|
|Krishna|         IOT| 10000|
+-------+------------+------+

In [13]:
# Adding columns to dataframe
# 1) adding column to dataframe with constant value

from pyspark.sql.functions import *
df.withColumn("Age",lit(25)).show()

+-------+------------+------+---+
|   Name| Departments|Salary|Age|
+-------+------------+------+---+
| Chandu|Data Science| 10000| 25|
| Chandu|         IOT|  5000| 25|
| Rohith|    Big Data|  4000| 25|
| Chandu|    Big Data|  4000| 25|
| Rohith|    Big Data|  3000| 25|
|Krishna|Data Science| 20000| 25|
|Krishna|         IOT| 10000| 25|
|Krishna|    Big Data|  5000| 25|
| Rashmi|Data Science| 10000| 25|
| Rashmi|    Big Data|  2000| 25|
+-------+------------+------+---+

In [19]:
# 2) Add Column Based on Another Column of DataFrame
# (i) Using withColumn() method
df.withColumn("New Salary",df.Salary+20000).show()

+-------+------------+------+----------+
|   Name| Departments|Salary|New Salary|
+-------+------------+------+----------+
| Chandu|Data Science| 10000|     30000|
| Chandu|         IOT|  5000|     25000|
| Rohith|    Big Data|  4000|     24000|
| Chandu|    Big Data|  4000|     24000|
| Rohith|    Big Data|  3000|     23000|
|Krishna|Data Science| 20000|     40000|
|Krishna|         IOT| 10000|     30000|
|Krishna|    Big Data|  5000|     25000|
| Rashmi|Data Science| 10000|     30000|
| Rashmi|    Big Data|  2000|     22000|
+-------+------------+------+----------+

In [18]:

# ii) using concat_ws
from pyspark.sql.functions import concat_ws
df.withColumn("Details",concat_ws("-","Name","Salary")).show()

+-------+------------+------+-------------+
|   Name| Departments|Salary|      Details|
+-------+------------+------+-------------+
| Chandu|Data Science| 10000| Chandu-10000|
| Chandu|         IOT|  5000|  Chandu-5000|
| Rohith|    Big Data|  4000|  Rohith-4000|
| Chandu|    Big Data|  4000|  Chandu-4000|
| Rohith|    Big Data|  3000|  Rohith-3000|
|Krishna|Data Science| 20000|Krishna-20000|
|Krishna|         IOT| 10000|Krishna-10000|
|Krishna|    Big Data|  5000| Krishna-5000|
| Rashmi|Data Science| 10000| Rashmi-10000|
| Rashmi|    Big Data|  2000|  Rashmi-2000|
+-------+------------+------+-------------+

In [15]:
# 3) Add column when not exists on dataframe
if "Age" not in df.columns:
    df.withColumn("Age",lit(45)).show()

+-------+------------+------+---+
|   Name| Departments|Salary|Age|
+-------+------------+------+---+
| Chandu|Data Science| 10000| 45|
| Chandu|         IOT|  5000| 45|
| Rohith|    Big Data|  4000| 45|
| Chandu|    Big Data|  4000| 45|
| Rohith|    Big Data|  3000| 45|
|Krishna|Data Science| 20000| 45|
|Krishna|         IOT| 10000| 45|
|Krishna|    Big Data|  5000| 45|
| Rashmi|Data Science| 10000| 45|
| Rashmi|    Big Data|  2000| 45|
+-------+------------+------+---+

In [65]:
# Handling Missing values

# Creating a dataframe containing null values
df1=spark.read.csv("C:\\Users\\DELL\\OneDrive\\Desktop\\Data Engineering Python\\DEPython\\mising.csv",header=True,inferSchema=True)
df1.show()

+------+----+----------+------+
|  Name| age|Experience|Salary|
+------+----+----------+------+
| Krish|  31|        10| 30000|
|  Sona|  30|         8| 25000|
|  Mona|  29|         4| 20000|
| Dhana|  24|         3| 20000|
|  Raju|  21|         1| 15000|
| Bannu|  23|         2| 18000|
|Chinnu|NULL|      NULL| 48999|
|  NULL|  34|        10| 38000|
|  NULL|  36|      NULL|  NULL|
+------+----+----------+------+

In [66]:
#Dropping rows based on null values
df1.na.drop().show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
|Krish| 31|        10| 30000|
| Sona| 30|         8| 25000|
| Mona| 29|         4| 20000|
|Dhana| 24|         3| 20000|
| Raju| 21|         1| 15000|
|Bannu| 23|         2| 18000|
+-----+---+----------+------+

In [67]:
## if all values in rows are null then drop otherwise by default any
df1.na.drop(how="all").show()

+------+----+----------+------+
|  Name| age|Experience|Salary|
+------+----+----------+------+
| Krish|  31|        10| 30000|
|  Sona|  30|         8| 25000|
|  Mona|  29|         4| 20000|
| Dhana|  24|         3| 20000|
|  Raju|  21|         1| 15000|
| Bannu|  23|         2| 18000|
|Chinnu|NULL|      NULL| 48999|
|  NULL|  34|        10| 38000|
|  NULL|  36|      NULL|  NULL|
+------+----+----------+------+

In [68]:
#atleast 2 non null values should be present. 

df1.na.drop(how="any",thresh=2).show()

+------+----+----------+------+
|  Name| age|Experience|Salary|
+------+----+----------+------+
| Krish|  31|        10| 30000|
|  Sona|  30|         8| 25000|
|  Mona|  29|         4| 20000|
| Dhana|  24|         3| 20000|
|  Raju|  21|         1| 15000|
| Bannu|  23|         2| 18000|
|Chinnu|NULL|      NULL| 48999|
|  NULL|  34|        10| 38000|
+------+----+----------+------+

In [87]:
# only in that column rows get deleted

df1.na.drop(how="any",subset=["Experience"]).show()

+-----+---+----------+------+
| Name|age|Experience|Salary|
+-----+---+----------+------+
|Krish| 31|        10| 30000|
| Sona| 30|         8| 25000|
| Mona| 29|         4| 20000|
|Dhana| 24|         3| 20000|
| Raju| 21|         1| 15000|
|Bannu| 23|         2| 18000|
| NULL| 34|        10| 38000|
+-----+---+----------+------+

In [70]:
######### Joining pyspark dataframes

# create a dataframe for employee
emp = [(1,"Smith",-1,"2018","10","M",3000), 
    (2,"Rose",1,"2010","20","M",4000), 
    (3,"Williams",1,"2010","10","M",1000), 
    (4,"Jones",2,"2005","10","F",2000), 
    (5,"Brown",2,"2010","40","",-1), 
      (6,"Brown",2,"2010","50","",-1) 
    ]
empColumns = ["emp_id","name","superior_emp_id","year_joined","emp_dept_id","gender","salary"]
empDF=spark.createDataFrame(data=emp,schema=empColumns)

In [71]:
print(type(empDF))

<class 'pyspark.sql.dataframe.DataFrame'>

In [72]:
empDF.show()

+------+--------+---------------+-----------+-----------+------+------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|
+------+--------+---------------+-----------+-----------+------+------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|
|     2|    Rose|              1|       2010|         20|     M|  4000|
|     3|Williams|              1|       2010|         10|     M|  1000|
|     4|   Jones|              2|       2005|         10|     F|  2000|
|     5|   Brown|              2|       2010|         40|      |    -1|
|     6|   Brown|              2|       2010|         50|      |    -1|
+------+--------+---------------+-----------+-----------+------+------+

In [73]:
# Create a dataframe for department

dept = [("Finance",10), 
    ("Marketing",20), 
    ("Sales",30), 
    ("IT",40) 
  ]
deptColumns = ["dept_name","dept_id"]
deptDF=spark.createDataFrame(data=dept,schema=deptColumns)
deptDF

DataFrame[dept_name: string, dept_id: bigint]

In [74]:
deptDF.show()

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|  Finance|     10|
|Marketing|     20|
|    Sales|     30|
|       IT|     40|
+---------+-------+

In [75]:
## 1) Inner Join
empDF.join(deptDF,empDF.emp_dept_id==deptDF.dept_id,"inner").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

In [83]:
# 2) Full outer join
empDF.join(deptDF,empDF.emp_dept_id==deptDF.dept_id,"outer").show()
                # or
empDF.join(deptDF,empDF.emp_dept_id==deptDF.dept_id,"full").show()
                # or
empDF.join(deptDF,empDF.emp_dept_id==deptDF.dept_id,"fullouter").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|  NULL|    NULL|           NULL|       NULL|       NULL|  NULL|  NULL|    Sales|     30|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
|     6|   Brown|              2|       2010|         50|      |    -1|     NULL|   NULL|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|  NULL|    NULL|           NULL|       NULL|       NULL|  NULL|  NULL|    Sales|     30|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
|     6|   Brown|              2|       2010|         50|      |    -1|     NULL|   NULL|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|  NULL|    NULL|           NULL|       NULL|       NULL|  NULL|  NULL|    Sales|     30|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
|     6|   Brown|              2|       2010|         50|      |    -1|     NULL|   NULL|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

In [82]:
# 3) Left outer join
empDF.join(deptDF,empDF.emp_dept_id==deptDF.dept_id,"left").show()
                # or
empDF.join(deptDF,empDF.emp_dept_id==deptDF.dept_id,"leftouter").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
|     6|   Brown|              2|       2010|         50|      |    -1|     NULL|   NULL|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
|     6|   Brown|              2|       2010|         50|      |    -1|     NULL|   NULL|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

In [84]:
# 4) Right outer join
empDF.join(deptDF,empDF.emp_dept_id==deptDF.dept_id,"right").show()
                # or
empDF.join(deptDF,empDF.emp_dept_id==deptDF.dept_id,"rightouter").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|  NULL|    NULL|           NULL|       NULL|       NULL|  NULL|  NULL|    Sales|     30|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     1|   Smith|             -1|       2018|         10|     M|  3000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|  NULL|    NULL|           NULL|       NULL|       NULL|  NULL|  NULL|    Sales|     30|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

In [86]:
# 5) Left semi join
#returns columns from the only left dataset for the records match in the right dataset on join expression, 
#records not matched on join expression are ignored from both left and right datasets.

empDF.join(deptDF,empDF.emp_dept_id==deptDF.dept_id,"leftsemi").show()

+------+--------+---------------+-----------+-----------+------+------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|
+------+--------+---------------+-----------+-----------+------+------+
|     1|   Smith|             -1|       2018|         10|     M|  3000|
|     3|Williams|              1|       2010|         10|     M|  1000|
|     4|   Jones|              2|       2005|         10|     F|  2000|
|     2|    Rose|              1|       2010|         20|     M|  4000|
|     5|   Brown|              2|       2010|         40|      |    -1|
+------+--------+---------------+-----------+-----------+------+------+

In [85]:
# 6) Left Anti join
#leftanti join does the exact opposite of the leftsemi
#leftanti join returns only columns from the left dataset for non-matched records.

empDF.join(deptDF,empDF.emp_dept_id==deptDF.dept_id,"leftanti").show()

+------+-----+---------------+-----------+-----------+------+------+
|emp_id| name|superior_emp_id|year_joined|emp_dept_id|gender|salary|
+------+-----+---------------+-----------+-----------+------+------+
|     6|Brown|              2|       2010|         50|      |    -1|
+------+-----+---------------+-----------+-----------+------+------+

In [88]:
# Example-2 on joins

# Creating a datframe for Employee Personal Details
data=[("1","Sona","TCS"),
      ("2","Mona","Infosys"),
      ("3","Bannu","Delloite"),
     ("4","Sunny","TCS"),
     ("5","Chinnu","Accenture")]
cols=["ID","Name","Company"]
df1=spark.createDataFrame(data,cols)
df1.show()

+---+------+---------+
| ID|  Name|  Company|
+---+------+---------+
|  1|  Sona|      TCS|
|  2|  Mona|  Infosys|
|  3| Bannu| Delloite|
|  4| Sunny|      TCS|
|  5|Chinnu|Accenture|
+---+------+---------+

In [90]:
df1.printSchema()
print(type(df1))

root
 |-- ID: string (nullable = true)
 |-- Name: string (nullable = true)
 |-- Company: string (nullable = true)

<class 'pyspark.sql.dataframe.DataFrame'>

In [92]:
# Creating a dataframe of employee salary details
data=[("1",45000,"HR"),
     ("2",90000,"Manager"),
     ("6",78000,"IT"),
     ("5",50000,"Sales")]

cols=["ID","Salary","Department"]
df2=spark.createDataFrame(data=data,schema=cols)
df2.show()

+---+------+----------+
| ID|Salary|Department|
+---+------+----------+
|  1| 45000|        HR|
|  2| 90000|   Manager|
|  6| 78000|        IT|
|  5| 50000|     Sales|
+---+------+----------+

In [93]:
df2.printSchema()
print(type(df2))

root
 |-- ID: string (nullable = true)
 |-- Salary: long (nullable = true)
 |-- Department: string (nullable = true)

<class 'pyspark.sql.dataframe.DataFrame'>

In [95]:
# 1) Inner join
df1.join(df2,df1.ID==df2.ID,"inner").show()

+---+------+---------+---+------+----------+
| ID|  Name|  Company| ID|Salary|Department|
+---+------+---------+---+------+----------+
|  1|  Sona|      TCS|  1| 45000|        HR|
|  2|  Mona|  Infosys|  2| 90000|   Manager|
|  5|Chinnu|Accenture|  5| 50000|     Sales|
+---+------+---------+---+------+----------+

In [96]:
# 2) outer join
df1.join(df2,df1.ID==df2.ID,"outer").show()

+----+------+---------+----+------+----------+
|  ID|  Name|  Company|  ID|Salary|Department|
+----+------+---------+----+------+----------+
|   1|  Sona|      TCS|   1| 45000|        HR|
|   2|  Mona|  Infosys|   2| 90000|   Manager|
|   3| Bannu| Delloite|NULL|  NULL|      NULL|
|   4| Sunny|      TCS|NULL|  NULL|      NULL|
|   5|Chinnu|Accenture|   5| 50000|     Sales|
|NULL|  NULL|     NULL|   6| 78000|        IT|
+----+------+---------+----+------+----------+

In [97]:
# 3) left join
df1.join(df2,df1.ID==df2.ID,"leftouter").show()

+---+------+---------+----+------+----------+
| ID|  Name|  Company|  ID|Salary|Department|
+---+------+---------+----+------+----------+
|  1|  Sona|      TCS|   1| 45000|        HR|
|  2|  Mona|  Infosys|   2| 90000|   Manager|
|  3| Bannu| Delloite|NULL|  NULL|      NULL|
|  4| Sunny|      TCS|NULL|  NULL|      NULL|
|  5|Chinnu|Accenture|   5| 50000|     Sales|
+---+------+---------+----+------+----------+

In [98]:
# 4) Right join
df1.join(df2,df1.ID==df2.ID,"right").show()

+----+------+---------+---+------+----------+
|  ID|  Name|  Company| ID|Salary|Department|
+----+------+---------+---+------+----------+
|   1|  Sona|      TCS|  1| 45000|        HR|
|   2|  Mona|  Infosys|  2| 90000|   Manager|
|NULL|  NULL|     NULL|  6| 78000|        IT|
|   5|Chinnu|Accenture|  5| 50000|     Sales|
+----+------+---------+---+------+----------+

In [99]:
# 5) left semi
df1.join(df2,df1.ID==df2.ID,"leftsemi").show()

+---+------+---------+
| ID|  Name|  Company|
+---+------+---------+
|  1|  Sona|      TCS|
|  2|  Mona|  Infosys|
|  5|Chinnu|Accenture|
+---+------+---------+

In [100]:
# 6) left anti
df1.join(df2,df1.ID==df2.ID,"leftanti").show()

+---+-----+--------+
| ID| Name| Company|
+---+-----+--------+
|  3|Bannu|Delloite|
|  4|Sunny|     TCS|
+---+-----+--------+